Repository: xcv58/MacTools
Catalog: Plugins/MiddleClick/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.disable.title
source: 关闭模拟鼠标中键
ar: تعطيل النقر بالزر الأوسط
de: Mittelklick deaktivieren
en: Disable Middle Click
es: Desactivar clic central
fr: Désactiver le clic du milieu
ja: ミドルクリックをオフにする
ko: 가운데 클릭 끄기
pt: Desativar clique do meio
ru: Отключить средний щелчок
tr: Orta Tıklamayı Devre Dışı Bırak
zh_hant: 關閉模擬滑鼠中鍵

# action.enable.title
source: 开启模拟鼠标中键
ar: تمكين النقر بالزر الأوسط
de: Mittelklick aktivieren
en: Enable Middle Click
es: Activar clic central
fr: Activer le clic du milieu
ja: ミドルクリックをオンにする
ko: 가운데 클릭 켜기
pt: Ativar clique do meio
ru: Включить средний щелчок
tr: Orta Tıklamayı Etkinleştir
zh_hant: 開啟模擬滑鼠中鍵

# metadata.title
source: 模拟鼠标中键
ar: النقر بالزر الأوسط
de: Mittelklick
en: Middle Click
es: Clic central
fr: Clic du milieu
ja: ミドルクリック
ko: 가운데 클릭
pt: Clique do meio
ru: Средний щелчок
tr: Orta Tıklama
zh_hant: 模擬滑鼠中鍵

# metadata.description
source: 触控板轻点 → 模拟鼠标中键
ar: حوّل نقرات لوحة التعقب إلى نقرات بالزر الأوسط.
de: Trackpad-Tippen als Mittelklick verwenden.
en: Turn trackpad taps into middle clicks.
es: Convierte los toques del trackpad en clics centrales.
fr: Transformez les touchers du trackpad en clics du milieu.
ja: トラックパッドのタップをミドルクリックに変換します。
ko: 트랙패드 탭을 가운데 클릭으로 전환합니다.
pt: Transforme toques no trackpad em cliques do meio.
ru: Преобразуйте касания трекпада в средние щелчки.
tr: Trackpad dokunuşlarını orta tıklamaya dönüştürün.
zh_hant: 觸控板輕點 → 模擬滑鼠中鍵

# permission.accessibility.title
source: 辅助功能授权
ar: إمكانية الوصول
de: Bedienungshilfen
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
pt: Acessibilidade
ru: Универсальный доступ
tr: Erişilebilirlik
zh_hant: 輔助使用授權

# permission.accessibility.description
source: 模拟鼠标中键需要辅助功能权限才能正常工作。
ar: تحتاج ميزة النقر بالزر الأوسط إلى إذن إمكانية الوصول لإرسال أحداث الماوس.
de: Mittelklick benötigt Zugriff auf die Bedienungshilfen, um Mausereignisse zu senden.
en: Middle Click needs Accessibility permission to send mouse events.
es: Clic central necesita permiso de Accesibilidad para enviar eventos del ratón.
fr: Clic du milieu nécessite l’autorisation d’accessibilité pour envoyer des événements de souris.
ja: ミドルクリックでマウスイベントを送信するには、アクセシビリティ権限が必要です。
ko: 가운데 클릭으로 마우스 이벤트를 보내려면 손쉬운 사용 권한이 필요합니다.
pt: Clique do meio precisa da permissão de Acessibilidade para enviar eventos do mouse.
ru: Для отправки событий мыши функции среднего щелчка требуется доступ к Универсальному доступу.
tr: Orta Tıklama, fare olayları göndermek için Erişilebilirlik izni gerektirir.
zh_hant: 模擬滑鼠中鍵需要輔助使用權限才能正常工作。

# permission.accessibility.footnote
source: 前往系统设置 → 隐私与安全性 → 辅助功能，授权 MacTools。
ar: افتح إعدادات النظام ← الخصوصية والأمان ← إمكانية الوصول، ثم اسمح لـ MacTools.
de: Öffne Systemeinstellungen → Datenschutz & Sicherheit → Bedienungshilfen und erlaube MacTools den Zugriff.
en: Open System Settings → Privacy & Security → Accessibility and allow MacTools.
es: Abre Ajustes del Sistema → Privacidad y seguridad → Accesibilidad y permite MacTools.
fr: Ouvrez Réglages Système → Confidentialité et sécurité → Accessibilité, puis autorisez MacTools.
ja: システム設定 → プライバシーとセキュリティ → アクセシビリティで MacTools を許可してください。
ko: 시스템 설정 → 개인정보 보호 및 보안 → 손쉬운 사용에서 MacTools를 허용하세요.
pt: Abra Ajustes do Sistema → Privacidade e Segurança → Acessibilidade e permita o MacTools.
ru: Откройте Системные настройки → Конфиденциальность и безопасность → Универсальный доступ и разрешите доступ для MacTools.
tr: Sistem Ayarları → Gizlilik ve Güvenlik → Erişilebilirlik'i açın ve MacTools'a izin verin.
zh_hant: 前往系統設定 → 隱私權與安全性 → 輔助使用，授權 MacTools。

# error.gestureConflict.format
source: 该轻点手势正由“%@”使用。请先停用对应映射。
ar: تستخدم "%@" إيماءة النقر هذه. عطّل التعيين المقابل أولاً.
de: Diese Tippgeste wird von „%@“ verwendet. Deaktiviere zuerst die entsprechende Zuordnung.
en: This tap gesture is used by “%@”. Disable the matching mapping first.
es: “%@” usa este gesto de toque. Desactiva primero la asignación correspondiente.
fr: Ce geste de toucher est utilisé par « %@ ». Désactivez d’abord l’association correspondante.
ja: このタップジェスチャは「%@」で使用されています。先に対応する割り当てを無効にしてください。
ko: 이 탭 제스처는 “%@”에서 사용 중입니다. 먼저 해당 매핑을 비활성화하세요.
pt: Este gesto de toque é usado por “%@”. Desative primeiro o mapeamento correspondente.
ru: Этот жест касания используется в «%@». Сначала отключите соответствующее назначение.
tr: Bu dokunma hareketi “%@” tarafından kullanılıyor. Önce eşleşen eşlemeyi devre dışı bırakın.
zh_hant: 此輕點手勢正由「%@」使用。請先停用對應的映射。

# error.accessibilityRequired
source: 模拟鼠标中键需要辅助功能权限，请先前往设置完成授权。
ar: يتطلب النقر بالزر الأوسط إذن إمكانية الوصول. امنحه أولًا في الإعدادات.
de: Mittelklick benötigt Zugriff auf die Bedienungshilfen. Erlaube den Zugriff zuerst in den Einstellungen.
en: Middle Click requires Accessibility permission. Grant it in Settings first.
es: Clic central requiere permiso de Accesibilidad. Concédelo primero en Ajustes.
fr: Clic du milieu nécessite l’autorisation d’accessibilité. Accordez-la d’abord dans les réglages.
ja: ミドルクリックにはアクセシビリティ権限が必要です。先に設定で許可してください。
ko: 가운데 클릭에는 손쉬운 사용 권한이 필요합니다. 먼저 설정에서 허용하세요.
pt: Clique do meio requer a permissão de Acessibilidade. Conceda-a primeiro nos Ajustes.
ru: Для среднего щелчка требуется Универсальный доступ. Сначала предоставьте его в настройках.
tr: Orta Tıklama, Erişilebilirlik izni gerektirir. Önce Ayarlar'dan izin verin.
zh_hant: 模擬滑鼠中鍵需要輔助使用權限，請先前往設定完成授權。

# settings.section.title
source: 设置
ar: الإعدادات
de: Einstellungen
en: Settings
es: Ajustes
fr: Réglages
ja: 設定
ko: 설정
pt: Ajustes
ru: Настройки
tr: Ayarlar
zh_hant: 設定

# settings.fingerCount.title
source: 手指数量
ar: عدد الأصابع
de: Fingeranzahl
en: Finger Count
es: Número de dedos
fr: Nombre de doigts
ja: 指の本数
ko: 손가락 수
pt: Número de dedos
ru: Количество пальцев
tr: Parmak Sayısı
zh_hant: 手指數量

# settings.fingerCount.description
source: 选择触发模拟鼠标中键所需的手指数。
ar: اختر عدد الأصابع المطلوبة لتنفيذ نقرة بالزر الأوسط.
de: Wähle, wie viele Finger einen Mittelklick auslösen.
en: Choose how many fingers are required to trigger a middle click.
es: Elige cuántos dedos se necesitan para activar un clic central.
fr: Choisissez le nombre de doigts nécessaires pour déclencher un clic du milieu.
ja: ミドルクリックを実行する指の本数を選択します。
ko: 가운데 클릭을 실행할 손가락 수를 선택합니다.
pt: Escolha quantos dedos são necessários para acionar um clique do meio.
ru: Выберите, сколько пальцев нужно для среднего щелчка.
tr: Orta tıklamayı tetiklemek için kaç parmak gerektiğini seçin.
zh_hant: 選擇觸發模擬滑鼠中鍵所需的手指數。

# settings.fingerCount.optionFormat
source: %d指
ar: %d أصابع
de: %d Finger
en: %d fingers
es: %d dedos
fr: %d doigts
ja: %d本指
ko: 손가락 %d개
pt: %d dedos
ru: %d
tr: %d parmak
